docs/bench_status.txt
Running 30s test @ http://127.0.0.1:3001/api/status
50 connections


┌─────────┬───────┬───────┬───────┬───────┬───────┬─────────┬───────┐
│ Stat    │ 2.5%  │ 50%   │ 97.5% │ 99%   │ Avg   │ Stdev   │ Max   │
├─────────┼───────┼───────┼───────┼───────┼───────┼─────────┼───────┤
│ Latency │ 11 ms │ 12 ms │ 19 ms │ 21 ms │ 13 ms │ 2.32 ms │ 69 ms │
└─────────┴───────┴───────┴───────┴───────┴───────┴─────────┴───────┘
┌───────────┬────────┬────────┬─────────┬─────────┬─────────┬─────────┬────────┐
│ Stat      │ 1%     │ 2.5%   │ 50%     │ 97.5%   │ Avg     │ Stdev   │ Min    │
├───────────┼────────┼────────┼─────────┼─────────┼─────────┼─────────┼────────┤
│ Req/Sec   │ 2,887  │ 2,887  │ 3,733   │ 3,999   │ 3,703.2 │ 214.15  │ 2,887  │
├───────────┼────────┼────────┼─────────┼─────────┼─────────┼─────────┼────────┤
│ Bytes/Sec │ 788 kB │ 788 kB │ 1.02 MB │ 1.09 MB │ 1.01 MB │ 58.4 kB │ 788 kB │
└───────────┴────────┴────────┴─────────┴─────────┴─────────┴─────────┴────────┘

Req/Bytes counts sampled once per second.
# of samples: 30

111k requests in 30.03s, 30.3 MB read